Sorting Data

In [1]:
import pandas as pd

In [2]:
# Working with example dataframe
people = {
    "first" : ["Anish", "Ramish", "Samish", "Bamish", "Bamish"],
    "last" : ["Khadka", "Mainali", "Shrestha", "Karki", "Mainali"],
    "email" : ["anishramish56@gmail.com", "mainaliramish89@gmail.com", 
               "shresthasamish28@gmail.com", "bamishkarki819@gmail.com",
               "bamishmainali78@gmail.com"]
}
mydf = pd.DataFrame(people)
mydf

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com

In [3]:
mydf.sort_values(by='last', ascending=False)

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [4]:
mydf.sort_values(by=['last', 'first'], ascending=False)

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [5]:
mydf.sort_values(by=['last', 'first'], ascending=[False, True]) # corresponding column

    first      last                       email
2  Samish  Shrestha  shresthasamish28@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
0   Anish    Khadka     anishramish56@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com

In [6]:
mydf.sort_index()

    first      last                       email
0   Anish    Khadka     anishramish56@gmail.com
1  Ramish   Mainali   mainaliramish89@gmail.com
2  Samish  Shrestha  shresthasamish28@gmail.com
3  Bamish     Karki    bamishkarki819@gmail.com
4  Bamish   Mainali   bamishmainali78@gmail.com

In [7]:
mydf['last'].sort_values()

3       Karki
0      Khadka
1     Mainali
4     Mainali
2    Shrestha
Name: last, dtype: object

Sorting with real data